Tutorials/TheRubyOnRailsTutorial/sample_app/app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Example User"], ["email", "user@example.com"], ["updated_at", "2017-06-23 21:43:04.869112"], ["id", 18875593]]
---
  def update
    if @user.update_attributes(user_params)